borodark/OS-II/erts/example/mini_beam_esp32/zephyr_app/src/main.c
#if OS2_HAS_MIC_PWR_EN
    if (device_is_ready(os2_mic_pwr_en.port) &&
        gpio_pin_configure_dt(&os2_mic_pwr_en, GPIO_OUTPUT_ACTIVE) == 0) {
        LOG_INF("mic_pwr enabled on pin %u", os2_mic_pwr_en.pin);
    }
#endif
}

/* --- I2C bus recovery and timeout-guarded probe --- */

#define OS2_I2C_PROBE_TIMEOUT_MS 500
#define OS2_I2C_PROBE_STACK_SIZE 1024

static struct {
    const struct device *dev;
    uint8_t addr;
    uint8_t reg;
    uint8_t value;
    int rc;
    struct k_sem done;
} os2_probe_ctx;

static K_THREAD_STACK_DEFINE(os2_probe_stack, OS2_I2C_PROBE_STACK_SIZE);
static struct k_thread os2_probe_thread;

static void os2_probe_thread_fn(void *p1, void *p2, void *p3) {
    ARG_UNUSED(p1);
    ARG_UNUSED(p2);
    ARG_UNUSED(p3);
    os2_probe_ctx.rc = i2c_write_read(os2_probe_ctx.dev,
                                       os2_probe_ctx.addr,
                                       &os2_probe_ctx.reg, 1U,
                                       &os2_probe_ctx.value, 1U);
    k_sem_give(&os2_probe_ctx.done);
}

/**
 * @brief Probe an I2C device with a timeout.
 * @return 0 on success, negative on I2C error, 1 on timeout.
 */
static int os2_i2c_probe_timeout(const struct device *dev, uint8_t addr,
                                  uint8_t reg, uint8_t *value) {
    k_sem_init(&os2_probe_ctx.done, 0, 1);
    os2_probe_ctx.dev = dev;
    os2_probe_ctx.addr = addr;
    os2_probe_ctx.reg = reg;
    os2_probe_ctx.value = 0;
    os2_probe_ctx.rc = -ETIMEDOUT;

    k_thread_create(&os2_probe_thread, os2_probe_stack,
                    OS2_I2C_PROBE_STACK_SIZE,
                    os2_probe_thread_fn, NULL, NULL, NULL,
                    K_PRIO_COOP(7), 0, K_NO_WAIT);

    if (k_sem_take(&os2_probe_ctx.done, K_MSEC(OS2_I2C_PROBE_TIMEOUT_MS)) != 0) {
        /* Timeout — probe thread is stuck in i2c_write_read.
         * Abort the thread so it doesn't linger. */
        k_thread_abort(&os2_probe_thread);
        LOG_WRN("i2c probe addr=0x%02x timed out after %dms", addr, OS2_I2C_PROBE_TIMEOUT_MS);
        return 1;
    }

    *value = os2_probe_ctx.value;
    return os2_probe_ctx.rc;
}

static const struct device *os2_get_i2c_dev(uint8_t bus) {
    if (bus == 0U) {
#if OS2_HAS_I2C0
        if (device_is_ready(os2_i2c0)) {
            return os2_i2c0;
        }
#endif
        return NULL;
    }
    if (bus == 1U) {
#if OS2_HAS_I2C1
        if (device_is_ready(os2_i2c1)) {
            return os2_i2c1;
        }
#endif
        return NULL;
    }
    return NULL;
}

static size_t os2_i2c_signature_scan(os2_sensor_target_t *targets, size_t max_targets) {
    size_t i;
    size_t found = 0;
    uint8_t next_id = 1;

    LOG_INF("i2c signature scan start");

    for (i = 0; i < ARRAY_SIZE(os2_sensor_sigs); i++) {
        const os2_sensor_sig_t *sig = &os2_sensor_sigs[i];
        const struct device *dev = os2_get_i2c_dev(sig->bus);
        uint8_t value = 0;
        int rc;

        if (dev == NULL) {
            LOG_INF("i2c bus%u skip (not ready)", sig->bus);
            continue;
        }
        LOG_INF("i2c bus%u probing %s addr=0x%02x ...", sig->bus, sig->name, sig->addr);
        rc = os2_i2c_probe_timeout(dev, sig->addr, sig->reg, &value);
        if (rc == 1) {
            continue; /* timed out — skip this sensor */
        }
        if (rc == 0) {
            LOG_INF("i2c bus%u probe %s addr=0x%02x reg=0x%02x val=0x%02x",
                sig->bus, sig->name, sig->addr, sig->reg, value);
            if (found < max_targets &&
                (value & sig->mask) == (sig->expected & sig->mask)) {
                targets[found].name = sig->name;
                targets[found].id = next_id++;
                targets[found].bus = sig->bus;
                targets[found].addr = sig->addr;
                targets[found].reg = sig->reg;
                found++;
            }
        }
    }
    if (found == 0) {
        LOG_WRN("i2c signature scan: no responders");
    }
    return found;
}

static int os2_enqueue_sensor_cmd(mb_scheduler_t *sched, mb_pid_t pid,
                                  const os2_sensor_target_t *target, os2_mb_stats_t *stats) {
    mb_command_t cmd;
    int rc;

    stats->attempted++;

    cmd.type = MB_CMD_I2C_READ;
    cmd.a = target->bus;
    cmd.b = target->addr;
    cmd.c = target->reg;
    cmd.d = target->id;

#if OS2_MB_POLICY_REJECT_NEW
    {
        mb_process_t *p = mb_sched_proc(sched, pid);
        if (p != NULL && p->mailbox.count >= MB_MAILBOX_CAPACITY) {
            stats->dropped_full++;
            return MB_MAILBOX_FULL;
        }
    }
#endif

    rc = mb_sched_send(sched, pid, cmd);
    if (rc == MB_OK) {
        stats->pushed++;
    } else if (rc == MB_MAILBOX_FULL) {
        stats->dropped_full++;
    }
    return rc;
}

static int os2_enqueue_pwm_cmd(mb_scheduler_t *sched, mb_pid_t pid,
                               uint8_t channel, uint16_t duty_permille,
                               uint8_t actuator_id, os2_mb_stats_t *stats) {
    mb_command_t cmd;
    int rc;

    stats->attempted++;

    cmd.type = MB_CMD_PWM_SET_DUTY;
    cmd.a = channel;
    cmd.b = duty_permille;
    cmd.c = 0;
    cmd.d = actuator_id;

#if OS2_MB_POLICY_REJECT_NEW
    {
        mb_process_t *p = mb_sched_proc(sched, pid);
        if (p != NULL && p->mailbox.count >= MB_MAILBOX_CAPACITY) {
            stats->dropped_full++;
            return MB_MAILBOX_FULL;
        }
    }
#endif

    rc = mb_sched_send(sched, pid, cmd);
    if (rc == MB_OK) {
        stats->pushed++;
    } else if (rc == MB_MAILBOX_FULL) {
        stats->dropped_full++;
    }
    return rc;
}

static os2_sensor_runtime_t *os2_find_runtime(os2_sensor_runtime_t *runtimes, size_t count, uint8_t sensor_id) {
    size_t i;
    for (i = 0; i < count; i++) {
        if (runtimes[i].id == sensor_id) {
            return &runtimes[i];
        }
    }
    return NULL;
}

static void os2_task_wdt_cb(int channel_id, void *user_data) {
    ARG_UNUSED(channel_id);
    ARG_UNUSED(user_data);
    LOG_ERR("task watchdog fired, rebooting");
    sys_reboot(SYS_REBOOT_COLD);
}

static int os2_task_wdt_start(void) {
    int rc = task_wdt_init(NULL);
    if (rc < 0) {
        return rc;
    }
    return task_wdt_add(OS2_WDT_TIMEOUT_MS, os2_task_wdt_cb, NULL);
}

static uint8_t os2_should_withhold_wdt_feed(const os2_sensor_runtime_t *runtimes, size_t count, uint32_t now_ms) {
    size_t i;
    for (i = 0; i < count; i++) {
        if (runtimes[i].degraded &&
            (now_ms - runtimes[i].degraded_since_ms) >= OS2_WDT_DEGRADED_GRACE_MS) {
            return 1U;
        }
    }
    return 0U;
}

static void os2_log_caps_v1(void) {
    LOG_INF("os2_caps_v1 #{caps_v=>%u,board=>%s,vm=>%s,event_schema=>%u,mailbox_depth=>%u,i2c=>%u,spi=>%u,pwm=>%u,adc=>#{channels=>%u,max_ksps=>%u},rtc=>%u,timers32=>%u,qdec=>%u,i2s=>%u,pdm=>%u,ble=>%u,easydma=>%u,policy=>%s,power_domains=>%s,wdt_ms=>%u}",
        os2_caps_v1.caps_v,
        os2_caps_v1.board_atom,
        os2_caps_v1.vm_atom,
        os2_caps_v1.event_schema_v,
        os2_caps_v1.mailbox_depth,
        os2_caps_v1.i2c_buses,
        os2_caps_v1.spi_masters,
        os2_caps_v1.pwm_channels,
        os2_caps_v1.adc_channels,
        os2_caps_v1.adc_max_ksps,
        os2_caps_v1.rtc_count,
        os2_caps_v1.timer32_count,
        os2_caps_v1.has_qdec,
        os2_caps_v1.has_i2s,
        os2_caps_v1.has_pdm,
        os2_caps_v1.has_ble,
        os2_caps_v1.has_easydma,
        os2_caps_v1.policy_atom,
        os2_caps_v1.power_domains_atoms,
        os2_caps_v1.wdt_timeout_ms);
}

int main(void) {
    static mb_scheduler_t sched;
    mb_pid_t pid_sensor, pid_actuator;
    mb_process_t *proc_s, *proc_a;
    int rc;
    os2_sensor_target_t targets[6];
    size_t target_count = 0;
    uint32_t last_ts = 0;
    uint32_t last_stats_ts = 0;
    size_t i;
    os2_mb_stats_t mb_stats = {0};
    os2_sensor_runtime_t runtimes[6] = {0};
    int wdt_channel = -1;
    uint8_t wdt_feed_blocked = 0;
    uint32_t resetreas_raw = NRF_POWER->RESETREAS;
    uint16_t boot_counter = 0;
    uint32_t last_pwm_ts = 0;
    uint8_t pwm_step = 0;
    static const uint16_t pwm_pattern[] = {150U, 500U, 850U, 500U};

