borodark/OS-II/erts/example/mini_beam_esp32/zephyr_app/src/main.c
#if defined(CONFIG_USB_DEVICE_STACK)
    {
        const struct device *const console_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
        uint32_t dtr = 0;
        int wait_ms = 0;

        /* Bring up USB CDC ACM so logs are visible on /dev/ttyACM*. */
        (void)usb_enable(NULL);
        while (wait_ms < 3000U) {
            if (uart_line_ctrl_get(console_dev, UART_LINE_CTRL_DTR, &dtr) == 0 && dtr) {
                break;
            }
            k_msleep(100);
            wait_ms += 100;
        }
    }
#endif

    LOG_INF("mini_beam_nrf52 start");
    LOG_INF("event schema v%d", OS2_EVENT_SCHEMA_VERSION);
    os2_log_caps_v1();
    boot_counter = os2_boot_counter_next();
    LOG_INF("boot counter=%u resetreas=0x%08x", (unsigned)boot_counter, resetreas_raw);
    NRF_POWER->RESETREAS = resetreas_raw;

#if OS2_ENABLE_TASK_WDT
    wdt_channel = os2_task_wdt_start();
    if (wdt_channel < 0) {
        LOG_ERR("task_wdt init failed rc=%d", wdt_channel);
        return wdt_channel;
    }
    LOG_INF("task_wdt enabled timeout_ms=%u grace_ms=%u",
        OS2_WDT_TIMEOUT_MS, OS2_WDT_DEGRADED_GRACE_MS);
#else
    LOG_WRN("task_wdt disabled via OS2_ENABLE_TASK_WDT=0");
#endif

    os2_try_enable_i2c_pullups();
    k_msleep(50);
    target_count = os2_i2c_signature_scan(targets, ARRAY_SIZE(targets));

    /* Spawn flow-compiled processes */
    mb_sched_init(&sched);
    for (i = 0; i < OS2_FLOW_SENSOR_COUNT; i++) {
        mb_pid_t p = mb_sched_spawn(&sched, os2_flow_sensor_progs[i],
                                     os2_flow_sensor_sizes[i]);
        LOG_INF("flow: sensor pid=%u (%u bytes)", p, (unsigned)os2_flow_sensor_sizes[i]);
        if (i == 0) { pid_sensor = p; proc_s = mb_sched_proc(&sched, p); }
    }
    pid_actuator = mb_sched_spawn(&sched, os2_flow_actuator_prog,
                                   sizeof(os2_flow_actuator_prog));
    proc_a = mb_sched_proc(&sched, pid_actuator);
    LOG_INF("flow: actuator pid=%u, %u total processes",
            pid_actuator, OS2_FLOW_PROCESS_COUNT);

    /*
     * Main loop: the flow-compiled programs are self-driving.
     * Sensor process polls I2C and SENDs to actuator on its own schedule.
     * Actuator process blocks on RECV_CMD and calls PWM BIF.
     * Native code ticks the scheduler and emits telemetry.
     */
    {
        uint32_t tick_count = 0;
        uint32_t event_count = 0;
        uint32_t idle_count = 0;
        uint32_t error_count = 0;
        uint32_t max_a_depth = 0;
        uint32_t max_s_depth = 0;

        while (1) {
            rc = mb_sched_tick(&sched);
            tick_count++;

            if (rc == MB_SCHED_IDLE) {
                idle_count++;
                /* No sleep — pure spin to find true ceiling */
            } else if (rc != MB_OK) {
                error_count++;
                if (error_count == 1) {
                    LOG_ERR("first error rc=%d at tick %u", rc, tick_count);
                }
            }

            /* Track new events without logging each one */
            {
                int32_t ts = MB_GET_SMALLINT(proc_s->regs[9]);
                if (ts != 0 && (uint32_t)ts != last_ts) {
                    event_count++;
                    last_ts = (uint32_t)ts;
                }
            }

            /* Track peak mailbox depth */
            if (proc_a->mailbox.count > max_a_depth) {
                max_a_depth = (uint32_t)proc_a->mailbox.count;
            }
            if (proc_s->mailbox.count > max_s_depth) {
                max_s_depth = (uint32_t)proc_s->mailbox.count;
            }

            /* Summary every 5 seconds — single LOG line */
            {
                uint32_t now_ms = k_uptime_get_32();
                if ((now_ms - last_stats_ts) >= 5000U) {
                    uint32_t elapsed = now_ms - last_stats_ts;
                    LOG_INF("STRESS ticks=%u events=%u idle=%u errors=%u "
                            "ticks/s=%u events/s=%u "
                            "a_depth_max=%u/%u s_depth_max=%u/%u "
                            "a_depth_now=%u s_depth_now=%u",
                            tick_count, event_count, idle_count, error_count,
                            (tick_count * 1000) / elapsed,
                            (event_count * 1000) / elapsed,
                            max_a_depth, (unsigned)MB_MAILBOX_CAPACITY,
                            max_s_depth, (unsigned)MB_MAILBOX_CAPACITY,
                            (unsigned)proc_a->mailbox.count,
                            (unsigned)proc_s->mailbox.count);
                    last_stats_ts = now_ms;
                    tick_count = 0;
                    event_count = 0;
                    idle_count = 0;
                    error_count = 0;
                    max_a_depth = 0;
                    max_s_depth = 0;
                }
            }

#if OS2_ENABLE_TASK_WDT
            if (task_wdt_feed(wdt_channel) < 0) {
                LOG_ERR("task_wdt feed failed");
                return -1;
            }
#endif
        }
    }

    return 0;
}
